// data.js
const flowchartData = [
    
     {
    id: '0002',
    title: 'trial',
    language: 'np',
    collector: 'सङ्कलनकर्ताः शिवप्रसादाचार्यः (२०८१)',
    organization: 'सर्वोच्च अदालत',
    diagram: `
flowchart TD
    A[कर्मचारी ३ महिना भन्दा बढी बिना सूचना अनुपस्थित<br>ऐन दफा ६१.१.छ]
    
    B[कार्यालय प्रमुखले अभिलेख जाँच<br>नियमावली नियम १२३]
    
    C[सम्बन्धित कर्मचारीको घर ठेगानामा पत्राचार<br>नियमावली नियम १२३.१]
    
    D{१५ दिने स्पष्टीकरण माग<br>नियमावली नियम ११२.१}
    
    E[जवाफ समीक्षा<br>नियमावली नियम ११२.२]
    
    F[स्थानीय/राष्ट्रिय पत्रपत्रिकामा सार्वजनिक सूचना<br>नियमावली नियम १२३.२]
    
    G{सूचनाको म्याद भित्र सम्पर्क?<br>नियमावली नियम १२३.३}
    
    H[विभागीय कारवाही सुरु<br>ऐन दफा ६६ र नियमावली नियम ११२]
    
    I{जवाफ सन्तोषजनक?<br>नियमावली नियम ११२.३}
    
    J[उचित निर्णय लिने]
    
    K[भविष्यमा सरकारी सेवाको निमित्त अयोग्य नठहरिने गरी<br>सेवाबाट हटाउने प्रक्रिया<br>ऐन दफा ६१.१.छ]
    
    L[अधिकार प्राप्त अधिकारी समक्ष प्रस्ताव पेश<br>ऐन दफा ६२]
    
    M[लोक सेवा आयोगको परामर्श<br>ऐन दफा ६९]
    
    N[अन्तिम निर्णयको लागि अधिकार प्राप्त<br>अधिकारी समक्ष पेश<br>नियमावली नियम ११२.४]
    
    O[सेवाबाट हटाउने निर्णय<br>ऐन दफा ६१.१.छ]
    
    P[सम्बन्धित कर्मचारीलाई जानकारी<br>नियमावली नियम ११३]
    
    A --> B --> C --> D
    D -->|हुन्छ| E
    D -->|हुन्न| F
    F --> G
    G -->|छ| E
    G -->|छैन| H
    E --> I
    I -->|छ| J
    I -->|छैन| H
    H --> K --> L --> M --> N --> O --> P

    style A fill:#ffcccc
    style H fill:#ff9999
    style O fill:#ff6666
}

 
];

export default flowchartData;
